<?php

// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
//活动库

return [    
         'type'           => 'mysql',
        'hostname' => '10.24.24.93',
        // 数据库名
        'database' => 'itbt_hd',
        // 用户名
        'username' => 'tp5rw',
        // 密码
        'password' => 'Gxnj#D@c90',
        // 端口
        'hostport' => '6606',
        'prefix' => 'wy_',
    
];
